




# 1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ არ არის სიტყვა 'car' ამ სიტყვაში/ტექსტში



# word = input("შეიყვანე სიტყვა: ")

# if 'a' in word or 'A' in word:
#     print("სიტყვაში არის 'a' ან 'A'")
# else:
#     print("სიტყვაში არ არის 'a' და 'A'")


# if 'car' not in word:
#     print("სიტყვაში არ არის 'car'")
# else:
#     print("სიტყვაში არის 'car'")



#     1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ "არ" არის სიტყვა 'car' ამ სიტყვაში/ტექსტში

# 2) მომხმარებელს შემოატანინეთ ტექსტი.
# -> დაუარეთ ამ ტექტის ასოებს for ლუპით
# -> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო









text = input("შეიყვანე სიტყვა: ")
if 'a' in text or 'A' in text:
    print("ტექსტში არის a ან A")
else:
    print("ტექსტში არ არის a ან A")

if 'car' not in text and 'CAR' not in text:
    print("სიტყვა 'car' არ არის ტექსტში")
else:
    print("სიტყვა 'car' არის ტექსტში")

text = input("შეიყვანე ტექსტი: ")
for i in range(len(text)):
    if text[i] == 'a' or text[i] == 'A':
        continue
    print(text[i])

    