
#1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი

# string --> მაგალითად "dachi", "goa","programing"
# integer --> მაგალითად 12, 123, 100, 999
# boolian --> true and false--> ჭეშმარიტია თუ მცადია
# float --> 1.23, 2.1



#2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი

# print("i love goa")
# print(100)
# print(1.23)
# print(True and False)

#3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)

# name_1 =("goa")
# number_1 =(999)
# float_1 =(1.23)
# bollian_1 =(True and False)

# print(name_1)
# print(number_1)
# print(float_1)
# print(bollian_1)


#4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ
# number_1 = (90)
# number_2 = (73)
# print(number_1 - number_2)
# print(number_1 * number_2)
# print(number_1 + number_2)
# print(number_1 / number_2)

#5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგები და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)

# string_1 =("dachis")
# string_2 =(" love goa")
# print(string_1 + string_2)

#სტრინგების დამატებას კონკატინაცია ეწოდება

#6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // ,** 
# % ამის მეშვეობით ჩვენ ვღებულობთ ნაშთს გაყოფის დროს 
# print(15%3)
# //
# **

#7)მომხმარებელს შემოატანინე ორი რიცხვიდ ა მოახდინე აბსოლიტურად ყველა ამთემატიკური მოქმედება ამ ორ რიცხვზე --> + - * / //  %
# integer =int(input("შეიყვანე პირველი რიცხვი"))
# integer_2 =int(input("შეიყვანე მეორე რიცხვი"))
 
# print(integer - integer_2)
# print(integer + integer_2)
# print(integer * integer_2)
# print(integer / integer_2)
# print(integer % integer_2)
# print(integer // integer_2)

#Bouns
# ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:
# 15 / 3 = 5
# 20 / 4 = 5
# 15 // 10 = 1
# 10 // 7 = 1
# 4 * 3 = 12
# 40 * 3 = 120
# 120 * 3 = 360
# 4 ** 3 = 64
# 10 ** 3 = 1000
# 10 % 7 = 3
# 3 % 2 = 1
#8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე



# str()--> ფრჩხილში ჩასმულ ყველაფერს რაც არ არის string აქცევს stringad
# int()--> აქცევს string რიხცვებს და floats integerad
# float()--> string float რიხცვებს და integerebs აქცევს floatad

#9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული ელემენტის ტიპს

# word =("i love goa")
# num = (123)
# num_1 =(12.9)
# bollian =(True and False) 

# print(type(word))
# print(type(num))
# print(type(num_1))   print(type(bollian))



  
#10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ),

# num_1=int(input("first number"))
# num_2=int(input("second number"))

# print(num_1 > num_2)
# print(num_1 < num_2)
# print(num_1==num_2)  
# print(num_1>=num_2)
# print(num_1<=num_2)
# print(num_1!=num_2)












#11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 
#ლოგიკური ოპერატორები არის and და or  
# and ის შემთხვევაში მაგ:True and True იქნება true ხოლო False and True  მოგვცემს False ამიტომ დიდი უპირატესობა აქვს False
# or ის შემთხვევაში მაგ: True or True იქნება true ხოლო False or True    მოგვცემს True ამიტომ დიდი უპირატესობა აქვს True



#12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
# True and True -- True      |   True or True -- True
# True and False -- False     |   True or False -- True
# False and True -- False    |   False or True -- True
# False and False -- False   |   False or False -- False
#13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
# 5 == 10 and 10 <= 10 -- False  |   True or "giorgi" == "giorgi" -- True
# True and False -- False       |   10 < 2 or "lasha" == "beqa" -- False
# 10 > 3 and 5 == 3 -- False   |   2 >= 3 or 40 < 2 -- False
# True and 200 <= 200 -- True    |   4 == 3 or 50 > 300 -- False

#14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop

# for i in range(5,200):
#     print(i)

#15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop
# for i in range( 100,150, 5 ):
#     print(i)



#16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop
# for i in range(10):
#     print("dachi")


#17)ტერმინალში გამოიტანეთ თქვენი რიცხვები 10 იდან 50 მდე while loop

# i=10
# while i <= 49:
#     print(i)
#     i+=1

 


#18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop

# i=50
# while i<=150:
#     print(i)
#     i+=10


#19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop

# i=0
# while i<10:
#     print("dachi")
#     i+=1 

# Lists
#20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი

# my_list =["dachi","gega","rezi","i love goa","pythonprograming"]

# for i in range(5):
#    print(my_list[i])
    
   


#21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და while loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 
# my_list =["dachi","gega","rezi","i love goa","pythonprograming"]

# i=0
# while i<5:
#     print(my_list[i])
#     i+=1


#22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების გამოყენებით
# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]
# print(my_list[2],my_list[5])
# print(my_list[-4],my_list[-1])

#23)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> 'ჰიდროელექტროსადგური" , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში
# my_list = "ჰიდროელექტროსადგური"
# print(my_list[3],my_list[8])

#24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"
# number =int(input("enter number"))
# if number > 0:
#     print("more than 0")
# elif number < 0:
#     print("Less than 0")
# else:
#     print("Equal 0")


#25)შექმენი ცვლადი სადაც შეინახავ სტადამიანების სახელებს(6 ცალი) სიას-->შემდეგ შეამოწმეთ --> თუ ამ სიაში მესამე ინდექსზე მდგომი ელემენტი არის "lasha" -->დაუპრინტე --> "You choose lasha" , თუ სიაში მყოფი ბოლო ინდექსზე მდგომი ელემენტი არის "giorgi" მაშინ დაუპრინტე -->"you choose giorgi" , სხვა შემთხვევაში დაუპრინტე --> "you choose other name"

# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]

# if my_list[3] == "საბა":
#     print("You choose saba")
# elif my_list[5] =="იამზე":
#     print("You choose iamze")
# else:
#     print("you didnt choose name")
  



#26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
# თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
# დაპრინტე --> გამოიცანი
# break
# სხვა შემთხვევაში:
# თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

# password="dachi magaria"
# მომხმარებელი=input("enter password")
# while True:
#     if მომხმარებელი == password:
#         print("you guessed password")
#         break
#     else:
#         print("try again")
    









#27)შექმენი ცვლადი და შეინახე სტრინგი --> "ჰიდროელექტროსადგური" , შენი დავალებაა რომ ტერმინალში გამოიტანო სადგური ,გამოიყენე slicing, ასევე კიდევ გამოიტანე ელექტროსადგური აქაც გამოიყენე სლაისინგი

# my_list = "ჰიდროელექტროსადგური"
# print(my_list[12:19])
# print(my_list[5:])



#28)შექმენი ცვლადი და შეინახე სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"] , შენი დავალებაა რომ ტერმინალში გამოიტანო ყველა სახელი საბადან სანიმდე,ასევე გამოიტანე სახელები გოგადან ირმა მდე გამოიყენე Slicing
# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]
# print(my_list[2:6])
# print(my_list[:4])

#29)შექმენი სია სადაც შეინახავთ ინტეჯერებს,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი მენულე ინდეწსზე მდგომი ელემენტი მეტია სიაში მყოფ ბოლო ინდექსზე მდგომ ელემენტზე და(and) ასევე სიის პირველი ელემენტი მეტია 0 ზე დაუპრინტე --> good , თუ სიის პირველი ელემენტი მეტია სიის ბოლო ელემენტზე და(and) სიის ნოლო ელემენტი ნაკლებია 0 ზე დაუპრინტე --> bad , სხვა შემთხვევაში დაუპრინტე -->"get out"
# my_list=[1,2,3,4,5,6,7,8,9,10]
# if my_list[0]>my_list[9] and my_list[0]>0:
#     print("good")
# elif my_list[0]>my_list[9] and my_list[9]<0:
#     print("bad")
# else:
#     print("get out!!!")

#30)შმომხმარებელს შემოატანინე ათწილადი,შემდეგ შეადარე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი და 30 ზე ნაკლები მაინ დაუპრინტე -->You entered number between 10 and 30, თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე ნაკლები და 0 ზე მეტი მაშნ დაუპრინტე --> You choose number between 0 and 10 , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები მაშინ დაუპრინტე you choose negative number , სხვა შემთხვევაში დაუპრინტე -->you choose zero(0)

# მომხმარებელი=float(input("enter float number "))
# if მომხმარებელი >10 and მომხმარებელი <30:
#     print("You entered number between 10 and 30")
# elif მომხმარებელი <10 and მომხმარებელი> 0:
#     print(" You choose number between 0 and 10")
# elif მომხმარებელი < 0:
#     print("you choose negative number ")
# else:
#     print("you choose zero(0)")


#31)შექმენი სია სადაც შეინახავ სტრინგებს(ადამიანის სახელებს,რაც გინდათ და რამდენიც გინდათ),შემდეგ შეადარეთ თუ ამ სიაში მყოფი მე0 ინდექსზე მდგომი ელემენტი არის 'luka' ან(or) არის "saba" დაუპრინტე -->You choose luka or saba, თუ ამ სიაში მყოფი ბოლო ინდექსზე მყოფი ელემენტი არის "irma" ან(or) "iamze" მაშინ დაუპრინტე --> You choose irma or iamze,სხვა შემთხვევაში დაუპტინტე --> You choose other name




# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]

# if my_list[0]=="luka" or my_list[0]=="საბა":
#     print("You choose luka or saba")
# elif my_list[-1] =="ირმა" or my_list[-1] == "იამზე":
#     print("You choose irma or iamze")
# else:
#     print("you choose other name")
                
       
     
    
# for ციკლით სიიდან გამოვიტანოთ ის სტრინგები რომელთა სიგრძე არის 6ზე მეტი

# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]

# for i in range(len(my_list)):
#     if len(my_list[i])>6:
#         print(my_list[i])


# my_list =["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]
# longest=""
# for i in range(len(my_list)):
#     if len(my_list[i]) > len(longest):
#         longest = my_list[i]
# print("ყველაზე დიდი სტრინგია",longest)