#1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა 
#უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
print(10>5 and 3<1)
print(40<39 and 9>2)
print(10>10 and 5<5)
print(6>7 and 6<2)
print(9<0 and 0<0)

print(10>500 or 2<3)
print(30>5 or 4>5)
print(10>9 and 6>5)
print(7<8 and 9>0)
print(300000>3000 or 900000000000000000000000<1000000000000000)


#2)კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე 
#თითეული მათგანი თქვენი სიტყვებით

#sequancing -->  თანმივდერობა რომლის მაგალითია როცა კომპიუტერი ჩვენს დაწერილ კოდს ზემოდან ქვემოთ კითხულობს
#iteration --> გამორება როდესაც რაიმე მოქმედება მეორდება რამდენჯერ ან სულ iteration--> ასევე არსი loop მოკლე სიტყვებით
#selection --> არჩევა









#3)მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი
#მაგალითი sequence
name1="dachi"
name2="rezi"
print("dachi" + "rezi" ) #ეს მოქმედება იმიტომ არის sequence რადგან ჩემს მიერ დაწერილი კოდი ზემოდან ქვემოთ წაიკითხავს კომპიუტერი







#4)კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

#for loop--> არის iterationis  მაგალითი და ჩვენ ის გვეხმარება რომ რაიმე რიცხვი ან სახელი გავიმეოროთ ბევრჯერ და ამისთვის მხოლოდ 2 კოდის დაწერა დაგვჭირდება












# 5)კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop
 
#range() ფუნქციას გადაეცემა რაიმე რიცხვი ფრიჩხილებში და foor loop თნ რომ იმუშავოს ასე უნდა დავწეროთ--> for i in range ():










# 6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop
for i in range(10):
    print("BMW and bugati")





# 7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
for i in range(100):
    print("arqania")







# 8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
for i in range(46):
    print("yellow")









# 9)შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
for i in range(32):
    print("d")















# # გამეორება
# 10)მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი
# დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ
# მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)

name_1=input()
name_2=input()
name_3=input()
name_4=input()
print(name_1 + name_2 + name_3 + str(name_4))





# 11)შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა 
# გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)
namE1=type("dachi")
num1=type(120)
num2=type(1.2)
naMe2=type(True and False)
print(namE1)
print(num1)
print(num2)
print(naMe2)


# 12)მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი
number1=120
number2=90
number3=10000
number4=12000000000
print(number1+number2+number3+number4)

result=12000010210






