
# 1)დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

for i in range(0,39):
    print(i)









# 2)დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში

for i in range(30,41):
    print(i)










# 3)დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში

for i in range(12,121):
    print(i)













# 4)დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ


for i in range(18):
    print("Dachi aris",13 ,"wlis" )
  










# 5)დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

for i in range(10,30,3):
    print(i)















# 6)ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

for i in range(1, 31):
    print(i, "ვაშლატამა")







# 7)მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop



name="ჟორა"
for i in range(18):
    print(name)

















# 8)გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

i = 0
while i < 10:
    print("dachi")
    i = i + 1



























# 9)დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

i = 0
while i <= 24:
    print(i)
    i = i + 1



















# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ
# NOTE : ჩემი დიდი თხოვნა იქნება რომ გადახედოთ კიდევ ერთხელ ჩანაწერს და ყურადღებით დაგახედოთ რესურსებში ჩაყრილ მასალას<3


for i in range(5):
    print("saxeli")


i = 0
while i < 5:
    print("saxeli")
    i = i + 1





for i in range(1, 11):
    print(i)




i = 0
while i < 5:
    print("hello")
    i = i + 1













