
# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

# user = input("type your name: ")
# uppered_user = user.upper()
# print(uppered_user)

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

# user = input("type your name in capital : ")
# lowered_user = user.lower()
# print(lowered_user)

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

# user = input("type your name: ")
# capital_user = user.capitalize()
# print(capital_user)

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

# my_name_list = ["dachi" ," rezi" , "gega" , "goga" ," gio"]
# for name in my_name_list:
#     print(name.upper())




# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით



# list = ["DACHI" ," REZI" , "GEGA" , "GOGA" , "GIO"]
# for name in list:
#     print(name.lower())



# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს

# my_name_list = ["dachi" , "rezi" , "gega" , "goga" , "gio"]
# for name in my_name_list:
#     print(name.capitalize())










# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

# my_name_list = ["dachi" , "rezi" , "gega" , "goga" , "gio"]

# num = len(my_name_list)

# print(num)










# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

# string = "ალექსანდრე"

# strin_g =len(string)
# print(strin_g)








# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

# my_num_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# count = 0  
# for num in my_num_list:
#     if num % 2 == 0:  
#         count += 1  
# print(count)










# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

# my_num_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# count = 0  
# for num in my_num_list:
#     if num % 2 != 0:  
#         count += 1  
# print(count)












# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

# start = int(input("type start number: "))
# end = int(input("type end number: "))
# step = int(input("type step number: "))
# for i in range(start , end , step):
#     if i % 2 == 0:
#         print(i)
 
















