
# 1) კომენტარის სახით ჩამოწერეთ  რომელი ახალი მათემატიკური ოპერატორები ვისწავლეთ,
# თითოეულ მათგანს მიუწერეთ  რომელი რას აკეთებს და თითზე მოიყვანე სამ-სამი მაგალითი

# %--> გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყოფთ მეორეზე
print(100%90) # დაბრუნება: 10
print(90%1000)#დაბრუნდება 90

# // --> ეს არის იგივე გაყოფის ნიშანი
print(10 // 7)  # --> ეს დააბრუნებს 1, რადგან 10 გაყოფილი 7-ზე = 1.428..., და მხოლოდ მთელი ნაწილი (1) მოიგება

#ეს არის ჩვეულებრივი გაყოფა
print(2 / 7)    # --> ეს დააბრუნებს 0.2857142857142857





# ** --> ეს ოპერატორი გვეხმარება რომ რიცხვი ავიყვანოთ რაიმე ხარისხში, მაგ 3**6: --> ამ მაგალითის შედეგი რომ გამოვთვალოთ 3 იანი უნდა
# გავამმრავლოთ თავის თვზე იმდენჯერ რამდენ ხარისხშიც ამყავ 3**6-->3*3*3*3*3*3


print(2**4)

print(3**2)

print(5**5)















# ცვლადი ინახავს მხოლოდ ერთ მონაცემს
# სია (list) ინახავს მრავალ მონაცემს ერთ ცვლადში
# ცვლადი -> ერთი მნიშვნელობა
# სია -> ბევრი მნიშვნელობა ერთ კოლექციაში, შეიძლება სხვადასხვა ტიპის
# სიებს ვიყენებთ, როცა გვჭირდება:
#   - მრავალ მონაცემზე მუშაობა ერთ ცვლადში
#   - მონაცემების დამატება, წაშლა, მოძებნა
#   - მონაცემებზე ციკლის გამოყენება


sia=["dachi",100,200,300,True]









print(sia)